Pandas seriler(tek boyutlu diziler) ve dataframeler(çok boyutlu diziler) üzerine kurulmuş bir python modülüdür. Veri işleme, veri temizleme, Veri Analizi ve Veri Madenciliği gibi alanlarda oldukça fazla kullanılır.

    PANDAS SERİLERİ

In [1]:
import numpy as np
import pandas as pd

In [2]:
#her bir pandas serisi indeks ve ona karşılık gelen değerlerden oluşur.
labels_list=["Ebru","Kerem","Ali","Ayşe"]
data_list=[10,70,13,58]
pd.Series(data=data_list,index=labels_list)

Ebru     10
Kerem    70
Ali      13
Ayşe     58
dtype: int64

In [3]:
pd.Series(data=data_list)

0    10
1    70
2    13
3    58
dtype: int64

In [4]:
pd.Series(data_list,labels_list)

Ebru     10
Kerem    70
Ali      13
Ayşe     58
dtype: int64

In [7]:
nparray=np.array([2,4,58,7])
pd.Series(nparray)

0     2
1     4
2    58
3     7
dtype: int32

In [8]:
pd.Series(nparray,labels_list)

Ebru      2
Kerem     4
Ali      58
Ayşe      7
dtype: int32

In [10]:
#sözlükler ile pandas serileri tanımlama
dataDict={"Hanife":10,"Yusuf":20,"İlbey":40,"Yiğit":80}
pd.Series(dataDict)

Hanife    10
Yusuf     20
İlbey     40
Yiğit     80
dtype: int64

In [13]:
ser2018=pd.Series([50,42,16],["Buğday","Erik","Kiraz"])
ser2018

Buğday    50
Erik      42
Kiraz     16
dtype: int64

In [14]:
ser2019=pd.Series([75,62,12],["Buğday","Vişne","Kiraz"])
ser2019

Buğday    75
Vişne     62
Kiraz     12
dtype: int64

In [17]:
total=ser2018+ser2019
total
#Erik ve Vişne ikisinde ortak olmadığından NaN hatası verir

Buğday    125.0
Erik        NaN
Kiraz      28.0
Vişne       NaN
dtype: float64

In [18]:
total["Kiraz"]

28.0

    DATAFRAMELERİN TANIMLANMASI

In [19]:
#dataframeler serilerin birleşmiş halidir ve üzerindeki sütunlar ve indeksler ile veri analizi yapılır
import numpy as np
import pandas as pd
from numpy.random import randn

In [20]:
randn(2)

array([-0.27366269,  0.18802632])

In [21]:
randn(2,2)

array([[ 1.94132042,  0.01035398],
       [-0.27560736,  1.3990332 ]])

In [24]:
#dataframe tanımlama
df = pd.DataFrame(randn(3,3),index = ["A","B","C"],columns = ["Column1","Column2","Column3"])
df

    Column1   Column2   Column3
A -0.364496  0.473788 -0.959373
B  1.948053  1.841823 -0.646198
C  0.098134  0.341478  0.595910

In [25]:
#sütun değerlerine göre sorgulama
df["Column2"]

A    0.473788
B    1.841823
C    0.341478
Name: Column2, dtype: float64

In [26]:
type(df["Column2"])
#dataframelerin serilerden oluştuğunu görebiliriz

pandas.core.series.Series

In [27]:
# index değerlerine göre sorgulama
df.loc["A"]

Column1   -0.364496
Column2    0.473788
Column3   -0.959373
Name: A, dtype: float64

In [28]:
type(df.loc["A"])

pandas.core.series.Series

In [29]:
# dataframe parçalama
df[["Column1","Column3"]]

    Column1   Column3
A -0.364496 -0.959373
B  1.948053 -0.646198
C  0.098134  0.595910

In [30]:
# dataframelere sütun ekleme
df

    Column1   Column2   Column3
A -0.364496  0.473788 -0.959373
B  1.948053  1.841823 -0.646198
C  0.098134  0.341478  0.595910

In [31]:
# seri tanımlayarak oluşturma
df["Column4"]=pd.Series(randn(3),index = ["A","B","C"])

In [32]:
df

    Column1   Column2   Column3   Column4
A -0.364496  0.473788 -0.959373 -1.978246
B  1.948053  1.841823 -0.646198  1.276470
C  0.098134  0.341478  0.595910  0.840721

In [33]:
#Column5 i diğer sütunların toplamı olarak hesaplama
df["Column5"]=df["Column1"]+df["Column2"]+df["Column3"]+df["Column4"]

In [34]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.364496  0.473788 -0.959373 -1.978246 -2.828327
B  1.948053  1.841823 -0.646198  1.276470  4.420148
C  0.098134  0.341478  0.595910  0.840721  1.876243

In [36]:
#drop(): sütun silme
#axis=0 ;satıra göre silme
#axis=1 ;sütuna göre silme
#inplace= yapılan değişikliği günceller
df.drop("Column5",axis=1,inplace=True)
df

    Column1   Column2   Column3   Column4
A -0.364496  0.473788 -0.959373 -1.978246
B  1.948053  1.841823 -0.646198  1.276470
C  0.098134  0.341478  0.595910  0.840721

In [40]:
# df=loc["A"]=df.iloc[0]
df.iloc[0]

Column1   -0.364496
Column2    0.473788
Column3   -0.959373
Column4   -1.978246
Name: A, dtype: float64

In [41]:
#column1 in A indeksine karşılık gelen değerin bulunması
df.loc["A","Column1"]

-0.3644957549179187

In [42]:
df.loc["B","Column3"]

-0.6461977187958889

In [43]:
df.loc[["A","B"],["Column2","Column3"]]

    Column2   Column3
A  0.473788 -0.959373
B  1.841823 -0.646198

    DATAFRAME FİLTRELEME

In [46]:
df=pd.DataFrame(randn(4,3),index = ["A","B","C","D"],columns = ["Column1","Column2","Column3"])
df

    Column1   Column2   Column3
A  0.573267  0.790769 -2.497392
B -0.112215 -0.630524 -0.130288
C  0.308772 -0.787810 -0.995974
D -1.011334 -0.099730 -0.835754

In [47]:
df>-1

   Column1  Column2  Column3
A     True     True    False
B     True     True     True
C     True     True     True
D    False     True     True

In [48]:
df>0

   Column1  Column2  Column3
A     True     True    False
B    False    False    False
C     True    False    False
D    False    False    False

In [49]:
booleanDf=df>0
booleanDf

   Column1  Column2  Column3
A     True     True    False
B    False    False    False
C     True    False    False
D    False    False    False

In [52]:
# 0 dan küçük olanları NaN olarak görebiliriz
#df[booleanDf]=df[df>0]
df[df>0]

    Column1   Column2  Column3
A  0.573267  0.790769      NaN
B       NaN       NaN      NaN
C  0.308772       NaN      NaN
D       NaN       NaN      NaN

In [53]:
df["Column1"]>0

A     True
B    False
C     True
D    False
Name: Column1, dtype: bool

In [54]:
df[df["Column1"]>0]
# B ve C satırları False değerini aldığından gösterilmez

    Column1   Column2   Column3
A  0.573267  0.790769 -2.497392
C  0.308772 -0.787810 -0.995974

In [55]:
df[(df["Column1"]>0) &(df["Column2"]<0) ]

    Column1  Column2   Column3
C  0.308772 -0.78781 -0.995974

In [59]:
df[(df["Column1"]>1) | (df["Column2"]>0) ]

    Column1   Column2   Column3
A  0.573267  0.790769 -2.497392

In [60]:
df

    Column1   Column2   Column3
A  0.573267  0.790769 -2.497392
B -0.112215 -0.630524 -0.130288
C  0.308772 -0.787810 -0.995974
D -1.011334 -0.099730 -0.835754

In [62]:
#dataframe e yeni sütun ekleme
df["Column4"]=pd.Series(randn(4),index = ["A","B","C","D"])
df

    Column1   Column2   Column3   Column4
A  0.573267  0.790769 -2.497392  0.840664
B -0.112215 -0.630524 -0.130288  1.103026
C  0.308772 -0.787810 -0.995974 -0.347285
D -1.011334 -0.099730 -0.835754  0.638486

In [64]:
#dataframe e yeni sütun ekleme
df["Column6"]=randn(4)
df

    Column1   Column2   Column3   Column4   Column6
A  0.573267  0.790769 -2.497392  0.840664 -0.796624
B -0.112215 -0.630524 -0.130288  1.103026 -1.784734
C  0.308772 -0.787810 -0.995974 -0.347285 -2.829552
D -1.011334 -0.099730 -0.835754  0.638486 -0.105357

In [65]:
df["Column6"]=["1","2","3","4"]
df

    Column1   Column2   Column3   Column4 Column6
A  0.573267  0.790769 -2.497392  0.840664       1
B -0.112215 -0.630524 -0.130288  1.103026       2
C  0.308772 -0.787810 -0.995974 -0.347285       3
D -1.011334 -0.099730 -0.835754  0.638486       4

In [70]:
#df.set_index: 
df.set_index("Column6", inplace=True)
df

          Column1   Column2   Column3   Column4
Column6
1        0.573267  0.790769 -2.497392  0.840664
2       -0.112215 -0.630524 -0.130288  1.103026
3        0.308772 -0.787810 -0.995974 -0.347285
4       -1.011334 -0.099730 -0.835754  0.638486

In [71]:
#df.index.names: bulunan indeks grubunun adını verir
df.index.names

FrozenList(['Column6'])

    DATAFRAMELERİN MULTİİNDEX İLE GRUPLANMASI

In [72]:
outerIndex = ["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]
innerIndex = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]
list(zip(outerIndex,innerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [73]:
a=list(zip(outerIndex,innerIndex))

In [74]:
a=pd.MultiIndex.from_tuples(a)
a

MultiIndex(levels=[['Group1', 'Group2', 'Group3'], ['Index1', 'Index2', 'Index3']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

In [75]:
df=pd.DataFrame(randn(9,3),a,columns=["col1","col2","col3"])
df

                   col1      col2      col3
Group1 Index1  0.808465  1.110816  0.037706
       Index2 -0.846402  1.207604 -0.161843
       Index3  0.879524  0.180769 -1.694987
Group2 Index1 -0.032658 -1.265525 -0.463269
       Index2 -0.472969  0.972283 -0.083738
       Index3 -1.172147 -0.054435 -0.779219
Group3 Index1 -1.042039  1.551020 -1.436568
       Index2  0.530673 -1.111303 -0.478907
       Index3  0.090357 -0.605945  0.730473

In [76]:
df["col1"]

Group1  Index1    0.808465
        Index2   -0.846402
        Index3    0.879524
Group2  Index1   -0.032658
        Index2   -0.472969
        Index3   -1.172147
Group3  Index1   -1.042039
        Index2    0.530673
        Index3    0.090357
Name: col1, dtype: float64

In [77]:
df.loc[["Group3","Group2"]]

                   col1      col2      col3
Group2 Index1 -0.032658 -1.265525 -0.463269
       Index2 -0.472969  0.972283 -0.083738
       Index3 -1.172147 -0.054435 -0.779219
Group3 Index1 -1.042039  1.551020 -1.436568
       Index2  0.530673 -1.111303 -0.478907
       Index3  0.090357 -0.605945  0.730473

In [78]:
df.loc["Group1"].loc["Index1"]

col1    0.808465
col2    1.110816
col3    0.037706
Name: Index1, dtype: float64

In [81]:
df.loc["Group2"].loc["Index1"]["col2"]

-1.265525279432956

In [82]:
df

                   col1      col2      col3
Group1 Index1  0.808465  1.110816  0.037706
       Index2 -0.846402  1.207604 -0.161843
       Index3  0.879524  0.180769 -1.694987
Group2 Index1 -0.032658 -1.265525 -0.463269
       Index2 -0.472969  0.972283 -0.083738
       Index3 -1.172147 -0.054435 -0.779219
Group3 Index1 -1.042039  1.551020 -1.436568
       Index2  0.530673 -1.111303 -0.478907
       Index3  0.090357 -0.605945  0.730473

In [84]:
df.index.names

FrozenList([None, None])

In [85]:
df.index.names=["Groups","Indexes"]
df

                    col1      col2      col3
Groups Indexes
Group1 Index1   0.808465  1.110816  0.037706
       Index2  -0.846402  1.207604 -0.161843
       Index3   0.879524  0.180769 -1.694987
Group2 Index1  -0.032658 -1.265525 -0.463269
       Index2  -0.472969  0.972283 -0.083738
       Index3  -1.172147 -0.054435 -0.779219
Group3 Index1  -1.042039  1.551020 -1.436568
       Index2   0.530673 -1.111303 -0.478907
       Index3   0.090357 -0.605945  0.730473

In [86]:
df.loc["Group1"]

             col1      col2      col3
Indexes
Index1   0.808465  1.110816  0.037706
Index2  -0.846402  1.207604 -0.161843
Index3   0.879524  0.180769 -1.694987

In [87]:
#df.loc["Group1"]=df.xs
df.xs("Group1")

             col1      col2      col3
Indexes
Index1   0.808465  1.110816  0.037706
Index2  -0.846402  1.207604 -0.161843
Index3   0.879524  0.180769 -1.694987

In [88]:
df.xs("Group1").xs("Index1")

col1    0.808465
col2    1.110816
col3    0.037706
Name: Index1, dtype: float64

In [89]:
df.xs("Group1").xs("Index1").xs("col2")

1.110815851236986

    KAYIP(MİSSİNG) VE BOZUK VERİLER

In [94]:
#veri analizi işlemlerinde kullanılacak verilerin boş ya da bozuk olmadığını görmek için ön işleme adımlarını gerçekleştirmeliyiz
arr=np.array([[10,np.nan,15],[np.nan,47,54],[15,np.nan,82]])
arr

array([[10., nan, 15.],
       [nan, 47., 54.],
       [15., nan, 82.]])

In [95]:
#array den dataframe oluşturma
df=pd.DataFrame(arr,index=["index1","index2","index3"],columns=["col1","col2","col3"])
df

        col1  col2  col3
index1  10.0   NaN  15.0
index2   NaN  47.0  54.0
index3  15.0   NaN  82.0

In [96]:
#dropna(axis=0): nan olan satırları siler
df.dropna()

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [97]:
#dropna(axis=1): nan olan sütunları siler
df.dropna(axis=1)

        col3
index1  15.0
index2  54.0
index3  82.0

In [98]:
# her zaman için nan verilerini silmek doğru olmayabilir. Bunun için bir threshold değeri belirleyebiliriz
df.dropna(thresh=2)
# min 2 tane doğru veri varsa SİLME

        col1  col2  col3
index1  10.0   NaN  15.0
index2   NaN  47.0  54.0
index3  15.0   NaN  82.0

In [99]:
df.dropna(thresh=3)

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [100]:
#fillna(): nan değerlerini silmek yerine;
df.fillna(value=1) #nan değerlerini 1 yapabiliriz

        col1  col2  col3
index1  10.0   1.0  15.0
index2   1.0  47.0  54.0
index3  15.0   1.0  82.0

In [101]:
#diğer verilerin ortalamasını alarak bir değer elde edebiliriz
#her sütuna ait değerlerin toplamı
df.sum()

col1     25.0
col2     47.0
col3    151.0
dtype: float64

In [102]:
#ve tüm sütun değerlerinin toplamı
df.sum().sum()

223.0

In [104]:
#kaç adet veri bulunduğu
df.size

9

In [111]:
#sütunlarda kaç adet nan değer olduğunu belirler
df.isnull().sum()

col1    1
col2    2
col3    0
dtype: int64

In [112]:
#nan değer sayısı
df.isnull().sum().sum()

3

In [113]:
# ORTALAMANIN nan DEĞERLERİ YERİNE KULLANILMASI
def ortHesapla(df):
    toplam=df.sum().sum()
    toplamNan=df.size-df.isnull().sum().sum()
    return toplam/toplamNan

In [115]:
df.fillna(value=ortHesapla(df),inplace=True)

In [116]:
df

             col1       col2  col3
index1  10.000000  37.166667  15.0
index2  37.166667  47.000000  54.0
index3  15.000000  37.166667  82.0

    GROUPBY SORGULARI

In [117]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [118]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000]}

In [119]:
df=pd.DataFrame(dataset)

In [120]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [123]:
# departmana göre groupby sorgusu
DepGroup=df.groupby("Departman")
DepGroup

In [124]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [126]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [127]:
#sadece bilişim departmanına ait verileri için 
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [128]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [129]:
#datasety üzerinde çalışanların sayısı
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [130]:
# maaşa göre en yüksek olan belirlenir, alfabetik sıraya görede string değerler alınır
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [131]:
df.groupby("Departman").min()

                 Çalışan  Maaş
Departman
Bilişim            Murat  3000
Üretim             Kadir  2500
İnsan Kaynakları   Ahmet  2000

In [132]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [133]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [134]:
#bilişim de çalışanların ortalama maaşları
df.groupby("Departman").mean()

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750

In [135]:
df.groupby("Departman").mean()["Maaş"]

Departman
Bilişim             3500
Üretim              3500
İnsan Kaynakları    2750
Name: Maaş, dtype: int64

In [136]:
df.groupby("Departman").mean()["Maaş"]["Bilişim"]

3500